Repository: darktable-org/darktable
Catalog: doc/usermanual/po/cs.tmx
Source language: en
Languages: cs

source: when creating XMP file the hierarchical tags are also added as a simple list of non-hierarchical ones to make them visible to some other programs. when this option is checked darktable will only include their last part and ignore the rest. so 'foo|bar|baz' will only add 'baz'.
cs: při vytváření souboru XMP jsou hierarchické štítky též přidány i jako jednoduchý seznam bez hierarchie, aby mohly být zobrazeny v některých jiných programech. při zaškrtnutí této volby se exportují pouze štítky nejníže v hiearchii a ignorují se všechny nadřazené. tj. "foo|bar|baz" se vyexportuje pouze jako "baz".

source: disable the entry completion
cs: vypnout doplňování vstupu

source: the entry completion is useful for those who enter tags from keyboard only. for others the entry completion can be embarrassing. need to restart darktable.
cs: doplňování vstupu je užitečné pro ty, kteří vkládají štítky pouze klávesnicí. pro ostatní způsoby může být doplňování otravné. je nutné znovu spustit darktable

source: password storage backend to use
cs: použitý mechanismus pro uchování hesel

source: none
cs: nic

source: the storage backend for password storage: auto, none, libsecret, kwallet
cs: mechanismus ukládání hesel: auto, nic, libsecret, kwallet

source: executable for playing audio files
cs: spustitelný program pro přehrávání audio souborů

source: this external program is used to play audio files some cameras record to keep notes for images
cs: tento externí program je použit pro přehrání audio souborů, které některé fotoaparáty vytváření pro zvukové poznámky ke snímkům

source: 3D lut root folder
cs: 3D LUT kořenová složka

source: select directory
cs: vybrat adresář

source: this folder (and sub-folders) contains Lut files used by lut3d modules. need to restart darktable.
cs: tato složka (a podsložky) obsahuje soubory LUT používané moduly lut3d. je třeba znovu spustit darktable.

source: session options
cs: volby sezení

source: base directory naming pattern
cs: vzor pojmenování pro základní adresář

source: part of full import path for an import session
cs: část úplné cesty, která se použije při importu

source: sub directory naming pattern
cs: vzor pojmenování pro podadresáře

source: file naming pattern
cs: vzor pojmenování souborů

source: file naming pattern used for a import session
cs: vzor pojmenování pro soubory, který se použije při importu

source: darktable manages your digital negatives in a database and lets you view them through a lighttable. It also enables you to develop raw images and enhance them in a darkroom.
cs: darktable spravuje vaše digitální negativy v databázi, nechá vás je prohlížet na prosvětlovacím pultu a vyvolávat ve fotokomoře včetně dalších vylepšení.

source: Other modes besides lighttable and darkroom are a map for geotagging, tethering, print and a slideshow.
cs: Ostatní režimy kromě prosvětlovacího pultu a fotokomory jsou režim mapy pro geottaging, režim vzdáleného snímání fotoaparátem, režim tisku a režim promítání.

source: darktable supports most modern cameras' raw formats, and does all of its processing at very high precision.
cs: darktable podporuje většinu formátů raw moderních fotoaparátů a jejich zpracování probíhá ve vysoké kvalitě.

source: Virtual light table, showing a collection
cs: Virtuální prosvětlovací pult, zobrazení sbírky

source: Virtual dark room with an opened image
cs: Virtuální fotokomora s otevřeným snímkem

source: Virtual dark room, sharpening an image
cs: Virtuální fotokomora, zaostřování snímku

source: Show images on a map
cs: Ukázat snímky na mapě

source: Print your images
cs: Vytisknout vaše snímky

source: _cancel
cs: _zrušit

source: _save
cs: _uložit

source: average dE: %.02f max dE: %.02f
cs: průměr dE: %.02f max dE: %.02f

source: TODO: sorry, due to API restrictions we currently cannot set the BPP to
cs: Není hotovo: sorry, kvůli omezením API nemůžeme v současné době nastavit BPP na

source: unknown option for --hq
cs: neznámá volba pro --hq

source: unknown option for --upscale
cs: neznámá volba pro --upscale

source: error: output file is a directory. please specify file name
cs: chyba: výstupní soubor je adresář. upravte prosím jméno souboru

source: output file already exists, it will get renamed
cs: výstupní soubor již existuje, bude přejmenován

source: error: can't open folder %s
cs: chyba: nelze otevřít složku %s

source: error: can't open file %s
cs: chyba: nelze otevřít soubor %s

source: no images to export, aborting
cs: žádný snímek pro export, zrušeno

source: error: can't open xmp file %s
cs: chyba: nelze otevřít soubor XMP %s

source: empty history stack
cs: vyprázdnit štos historie

source: cannot find disk storage module. please check your installation, something seems to be broken.
cs: nelze nalézt modul pro ukládání souborů. prosím zkontrolujte instalaci sw, něco se asi rozbilo.

source: failed to get parameters from storage module, aborting export ...
cs: selhalo získání parametrů z modulu ukládání, export zrušen...

source: unknown extension '.%s'
cs: neznámá přípona ".%s"

source: failed to get parameters from format module, aborting export ...
cs: selhalo získání parametrů z modulu formátu, export zrušen...

source: too much time to update aspect ratio for the collection
cs: příliš pomalá aktualizace poměru stran pro sbírku

source: red
cs: červená

source: yellow
cs: žlutá

source: green
cs: zelená

source: blue
cs: modrá

source: purple
cs: purpová

source: altered
cs: změněno

source: tagged
cs: oštítkováno

source: not copied locally
cs: nekopírován lokálně

source: group leaders
cs: vedoucí skupiny

source: %d image of %d (#%d) in current collection is selected
cs: vybrán %d snímek z %d (#%d) v aktuální sbírce

source: %d image of %d in current collection is selected
cs: vybrán %d snímek z %d v aktuální sbírce

source: Adobe RGB (compatible)
cs: Adobe RGB (kompatibilní)

source: linear Rec709 RGB
cs: lineární Rec709 RGB

source: linear Rec2020 RGB
cs: lineární Rec2020 RGB

source: linear XYZ
cs: lineární XYZ

source: linear infrared BGR
cs: lineární infračervené BGR

source: system display profile
cs: syst. profil displeje

source: embedded ICC profile
cs: vložený profil ICC

source: embedded matrix
cs: vložená matice

source: standard color matrix
cs: standardní matice barev

source: enhanced color matrix
cs: vylepšená matice barev

source: vendor color matrix
cs: výrobcova matice barev

source: alternate color matrix
cs: alternativní matice barev

source: BRG (experimental)
cs: BRG (experimentální)

source: export profile
cs: exportní profil

source: softproof profile
cs: profil pro softproof

source: work profile
cs: pracovní profil

source: sRGB (e.g. JPG)
cs: sRGB (např. JPEG)

source: sRGB (web-safe)
cs: sRGB (pro web)

source: linear prophoto RGB
cs: lineární prophoto RGB

source: BRG (for testing)
cs: BRG (pro testování)

source: file `%s' to print not found for image %d on `%s'
cs: soubor k vytištění "%s" nebyl nalezen pro snímek %d na "%s"

source: failed to create temporary file for printing options
cs: selhalo vytvoření dočasného souboru pro volby tisku

source: printing on `%s' cancelled
cs: tisk na "%s" zrušen

source: error while printing `%s' on `%s'
cs: chyba při tisku "%s" na "%s"

source: printing `%s' on `%s'
cs: tisk "%s" na "%s"

source: found strange path `%s'
cs: nalezena podivná cesta "%s"

source: error loading directory `%s'
cs: chyba při čtení adresáře "%s"

source: file `%s' has unknown format!
cs: soubor "%s" je neznámého formátu!

source: error loading file `%s'
cs: chyba při čtení souboru "%s"

source: darktable - run performance configuration?
cs: darktable - spustit konfiguraci výkonu?

source: we have an updated performance configuration logic - executing that might improve the performance of darktable. this will potentially overwrite some of your existing settings - especially in case you have manually modified them to custom values. would you like to execute this update of the performance configuration?
cs: aktualizovali jsme logiku konfigurace výkonu - její spuštění může vést ke zlepšení výkonu darktable. je možné, že budou přepsána některá existující uživatelská nastavení - zvláště v případě, pokud jste je ručně změnili. chcete spustit tuto aktualizaci konfigurace pro zlepšení výkonu?

source: no
cs: ne

source: yes
cs: ano

source: an error has occurred while trying to open the database from <span style="italic">%s</span> %s
cs: došlo k chybě při pokusu o otevření databáze z <span style="italic">%s</span> %s

source: darktable - error locking database
cs: darktable - chyba při zamykání databáze

source: close darktable
cs: zavřít darktable

source: the database lock file contains a pid that seems to be alive in your system: %d
cs: soubor zámku databáze obsahuje PID, který vypadá jako aktuálně spuštěný proces na vašem systému: %d

source: the database lock file seems to be empty
cs: soubor zámku databáze vypadá prázdně

source: error opening the database lock file for reading: %s
cs: chyba při otevírání souboru zámku databáze pro čtení: %s

source: the database schema has to be upgraded for <span style="italic">%s</span> do you want to proceed or quit now to do a backup
cs: databázové schéma musí být povýšeno na vyšší verzi <span style="italic">%s</span> chcete pokračovat nebo skončit (abyste provedl zálohu)?

source: darktable - schema migration
cs: darktable - migrace schématu

source: upgrade database
cs: upgradovat databázi

source: an error has occurred while trying to open the database from <span style="italic">%s</span> it seems that the database is corrupt. do you want to close darktable now to manually restore the database from a backup or start with a new one?
cs: chyba při pokusu o otevření databáze z <span style="italic">%s</span> vypadá to na poškozenou databázi. chcete nyní zavřít darktable a pokusit se obnovit databázi ze zálohy (ručně, máte-li ji) nebo začít s novou databází?

source: darktable - error opening database
cs: darktable - chyba při otevírání databáze

source: delete database
cs: smazat databázi

source: fast guided filter failed to allocate memory, check your RAM settings
cs: Alokace paměti selhala pro rychle vedený filtr, zkontrolujte nastavení RAM

source: do you want to remove this empty directory?
cs: chcete odstranit tento prázdný adresář?

source: remove empty directory?
cs: odstranit prázdný adresář?

source: name
cs: jméno

source: cannot remove film roll having local copies with non accessible originals
cs: nelze odstranit roli filmu s lokální kopií, aniž by byl přístupný originál

source: you need to copy history from an image before you paste it onto another
cs: musíte zkopírovat historii snímku dříve, než ji vložíte na jiný snímek

source: on
cs: zapnuto

source: Sorry,<p>something went wrong. Please try again.</p>
cs: promiňte,<p>něco se pokazilo. zkuste to prosím znovu.</p>

source: Thank you,<p>everything should have worked, you can <b>close</b> your browser now and <b>go back</b> to darktable.</p>
cs: děkuji,<p>všechno proběhlo v pořádku, nyní můžete<b>zavřít</b> váš prohlížeč a <b>vrátit se</b> do darktable.</p>

source: orphaned image
cs: opuštěný snímek

source: cannot access local copy `%s'
cs: nelze číst místní kopii "%s"

source: cannot write local copy `%s'
cs: nelze zapsat místní kopii "%s"

source: error moving local copy `%s' -> `%s'
cs: chyba při přemísťování lokální kopie "%s" -> "%s"

source: error moving `%s': file not found
cs: chyba při přemísťování "%s": soubor nenalezen

source: error moving `%s' -> `%s': file exists
cs: chyba při přemísťování "%s" -> "%s": soubor existuje

source: error moving `%s' -> `%s'
cs: chyba při přemístění "%s" -> "%s"

source: cannot create local copy when the original file is not accessible.
cs: nelze vytvořit lokální kopii, když není dostupný původní soubor.

source: cannot create local copy.
cs: nelze vytvořit místní kopii.

source: cannot remove local copy when the original file is not accessible.
cs: nelze odstranit lokální kopii, když není dostupný původní soubor.

source: %d local copy has been synchronized
cs: %d lokální kopie byla synchronizována

source: image `%s' is not available!
cs: snímek "%s" není dostupný!

source: failed to allocate memory for %s, please lower the threads used for export or buy more memory.
cs: chyba při alokování paměti pro %s, snižte prosím počet vláken použitých pro export nebo kupte více paměti.

source: thumbnail export
cs: export náhledů

source: cannot find the style '%s' to apply during export.
cs: nelze nalézt styl "%s" pro aplikování během exportu.

source: couldn't expand to a unique filename for session, please check your import session settings.
cs: nelze vytvořit jedinečné jméno souboru pro sezení, prosím zkontrolujte nastavení vzoru pojmenování v globálních předvolbách.

source: unsupported working profile %s has been replaced by Rec2020 RGB!
cs: nepodporovaný typ vstupního profilu %s byl nahrazen Rec709 RGB!

source: generic poissonian
cs: obecný poissonian

source: noiseprofile file `%s' is not valid
cs: soubor profilu šumu '%s' není platný

source: due to a slow GPU hardware acceleration via opencl has been de-activated.
cs: kvůli pomalé hardwarové akceleraci GPU bylo deaktivováno opencl.

source: multiple GPUs detected - opencl scheduling profile has been set accordingly.
cs: zjištěno více jednotek GPU - plánovácí profil OpenCL byl změněn.

source: very fast GPU detected - opencl scheduling profile has been set accordingly.
cs: zjištěna velmi rychlá GPU - plánovácí profil OpenCL byl změněn.

source: opencl scheduling profile set to default.
cs: plánovací profil OpenCL byl nastaven na výchozí hodnotu.

source: inch
cs: palec

source: GNOME Keyring backend is no longer supported. configure a different one
cs: klíčenka GNOME již není podporována. nakonfigurujte jinou

source: rejecting %d image
cs: odmítnutí %d snímku

source: applying rating %d to %d image
cs: nastavování hodnocení %d %d snímku

source: no images selected to apply rating
cs: není vybrán snímek pro hodnocení

source: style with name '%s' already exists
cs: styl pojmenovaný "%s" již existuje

source: styles/apply %s
cs: styly/použít %s

source: style named '%s' successfully created
cs: styl pojmenovaný "%s" byl úspěšně vytvořen

source: no image selected!
cs: není vybrán žádný snímek!

source: module `%s' version mismatch: %d != %d
cs: neshoda verze modulu %s: %d != %d

source: failed to overwrite style file for %s
cs: nelze přepsat soubor stylů pro %s

source: style file for %s exists
cs: soubor se stylem pro "%s" již existuje

source: style %s was successfully imported
cs: styl %s byl úspěšně importován

source: above sea level
cs: nad hladinou moře

source: below sea level
cs: pod hladinou moře

source: working..
cs: zpracovává se...

source: scroll to change <b>%s</b> of %s module
cs: rolovat pro změnu <b>%s</b> modulu %s

source: select
cs: vybrat

source: path
cs: cesta

source: xmp timestamp
cs: časová značka XMP

source: database timestamp
cs: časová značka databáze

source: updated xmp sidecar files found
cs: nalezeny aktualizované postranní soubory XMP

source: _close
cs: _zavřít

source: select all
cs: vybrat vše

source: reload selected xmp files
cs: znovu načíst vybrané soubory XMP

source: overwrite selected xmp files
cs: přepsat vybrané soubory XMP

source: capturing %d image
cs: pořizování %d snímku

source: please set your camera to manual mode first!
cs: prosím nejprve nastavte fotoaparát do manuálního režimu!

source: capture images
cs: pořídit snímky

source: %d/%d imported to %s
cs: %d/%d importován do %s

source: starting to import images from camera
cs: začíná import snímků z fotoaparátu

source: importing %d image from camera
cs: importování %d snímku z fotoaparátu

source: import images from camera
cs: importovat snímky z fotoaparátu

source: failed to create film roll for destination directory, aborting move..
cs: selhalo vytvoření role filmu pro cílový adresář, přesun snímků zrušen...

source: exposure bracketing only works on raw images.
cs: krokování expozice funguje pouze se snímky raw.

source: images have to be of same size and orientation!
cs: snímky musejí být stejně veliké a se stejnou orientací!

source: merging %d image
cs: slučování %d snímku

source: wrote merged HDR `%s'
cs: spojený snímek HDR "%s" uložen

source: duplicating %d image
cs: vytváření duplikátu %d snímku

source: flipping %d image
cs: převracení %d snímku

source: removing %d image
cs: odstraňování %d snímku

source: could not send %s to trash%s%s
cs: nelze přemístit %s do koše%s%s

source: could not physically delete %s%s%s
cs: nepodařilo se fyzicky smazat z disku %s%s%s

source: physically delete
cs: fyzicky smazat z disku

source: physically delete all files
cs: fyzicky smazat všechny soubory

source: only remove from the collection
cs: pouze odstranit ze sbírky

source: skip to next file
cs: přejít na další soubor

source: stop process
cs: zastavit proces

source: trashing error
cs: chyba při přemisťování do koše

source: deletion error
cs: chyba při mazání

source: trashing %d image
cs: přemísťování %d snímku do koše

source: deleting %d image
cs: mazání %d snímku

source: failed to parse GPX file
cs: selhala analýza souboru GPX

source: applied matched GPX location onto %d image
cs: zapsána nalezená lokace GPX do %d snímku

source: moving %d image
cs: přemisťování %d snímku

source: moving %d images
cs: přemisťování %d snímků

source: copying %d image
cs: kopírování %d snímku

source: copying %d images
cs: kopírování %d snímků

source: creating local copy of %d image
cs: vytváření lokální kopie %d snímku

source: removing local copy of %d image
cs: odstraňování lokální kopie %d snímku

source: refreshing info for %d image
cs: obnovování info pro %d snímek

source: exporting %d image..
cs: exportování %d snímku...

source: exporting %d image to %s
cs: exportování %d snímku do %s

source: image `%s' is currently unavailable
cs: snímek "%s" je aktuálně nedostupný

source: merge hdr image
cs: slučování hdr snímku

source: duplicate images
cs: duplikovat snímky

source: flip images
cs: převrátit snímky

source: remove images
cs: odstranit snímky

source: do you really want to remove %d selected image from the collection?
cs: opravdu chcete vyjmout %d vybraný snímek ze sbírky?

source: remove images?
cs: odstranit snímky?

source: delete images
cs: smazat snímky

source: do you really want to send %d selected image to trash?
cs: opravdu chcete přemístit %d vybraný snímek do koše?

source: do you really want to physically delete %d selected image from disk?
cs: opravdu chcete fyzicky smazat %d vybraný snímek z disku?

source: trash images?
cs: hodit snímky do koše?

source: delete images?
cs: smazat snímky?

source: move images
cs: přesunout snímky

source: _select as destination
cs: _vybrat jako cíl

source: do you really want to physically move the %d selected image to %s? (all unselected duplicates will be moved along)
cs: opravdu chcete fyzicky přemístit %d vybraný snímek do %s? (všechny nevybrané duplikáty budou taktéž přesunuty)

source: move image?
cs: přesunout snímek?

source: copy images
cs: kopírovat snímky

source: do you really want to physically copy the %d selected image to %s?
cs: opravdu chcete fyzicky smazat %d vybraný snímek z disku?

source: copy image?
cs: kopírovat snímek?

source: local copy images
cs: lokální kopie snímků

source: refresh exif
cs: znovu načíst exif

source: failed to get parameters from storage module `%s', aborting export..
cs: selhalo získání parametrů z modulu úložiště "%s", export zrušen..

source: export images
cs: exportovat snímky

source: adding time offset to %d image
cs: přidávání posunu času do %d snímku

source: added time offset to %d image
cs: přidán posun času pro %d snímek

source: time offset
cs: posun času

source: write sidecar files
cs: uložit soubory XMP

source: import images
cs: importovat snímky

source: no supported images were found to be imported
cs: nebyly nalezeny žádné podporované soubory pro import

source: importing %d image
cs: importování %d snímku

source: importing image %s
cs: importování snímku %s

source: import image
cs: importovat snímek

source: skipped blending in module '%s': roi's do not match
cs: vynechané prolínání v modulu "%s": oblasti zájmu (ROI) nesouhlasí

source: could not allocate buffer for blending
cs: nelze alokovat mezipaměť pro prolínání

source: sliders for L channel
cs: posuvníky pro kanál L

source: sliders for a channel
cs: posuvníky pro kanál

source: sliders for b channel
cs: posuvníky pro kanál b

source: sliders for chroma channel (of LCh)
cs: posuvníky pro kanál chroma (dle LCh)

source: sliders for hue channel (of LCh)
cs: posuvníky pro kanál hue (dle LCh)

source: sliders for gray value
cs: posuvníky pro hodnotu šedé

source: sliders for red channel
cs: posuvníky pro červený kanál

source: sliders for green channel
cs: posuvníky pro zelený kanál

source: sliders for blue channel
cs: posuvníky pro modrý kanál

source: sliders for hue channel (of HSL)
cs: posuvníky pro kanál hue (dle HSL)

source: sliders for chroma channel (of HSL)
cs: posuvníky pro kanál chroma (dle HSL)

source: sliders for value channel (of HSL)
cs: posuvníky pro kanál hodnota (dle HSL)

source: adjustment based on input received by this module: * range defined by upper markers: blend fully * range defined by lower markers: do not blend at all * range between adjacent upper/lower markers: blend gradually
cs: úprava závisející na vstupu přijatém tímto modulem: * rozsah definovaný horními značkami: plně prolnout * rozsah definovaný dolními značkami: vůbec neprolínat * rozsah mezi sousedícími horními/dolními značkami: částečně prolnout

source: adjustment based on unblended output of this module: * range defined by upper markers: blend fully * range defined by lower markers: do not blend at all * range between adjacent upper/lower markers: blend gradually
cs: úprava závisející na nesmíšeném výstupu tohoto modulem: * rozsah definovaný horními značkami: plně smísit * rozsah definovaný dolními značkami: vůbec nemísit * rozsah mezi sousedícími horními/dolními značkami: částečně smísit

source: pick GUI color from image ctrl+click to select an area
cs: vybrat barvu GUI ze snímku ctrl+kliknutí pro výběr oblasti

source: set the range based on an area from the image click+drag to use the input image ctrl+click + drag to use the output image
cs: nastavit rozsah založený na oblasti ze snímku kliknutí+tažení pro použití vstupního snímku ctrl+kliknutí + tažení pro použití výstupního snímku

source: reset blend mask settings
cs: obnovit nastavení masky prolnutí

source: invert all channel's polarities
cs: invertovat polaritu všech kanálů

source: toggle polarity. best seen by enabling 'display mask'
cs: přepnout polaritu. nejlépe viditelné, pokud zapnete "zobrazit masku"

source: output
cs: výstup

source: input
cs: vstup

source: double click to reset
cs: dvojitým kliknutím obnovit výchozí

source: parametric mask
cs: parametrická maska

source: %d shape used
cs: %d tvar použit

source: no mask used
cs: nepoužita žádná maska

source: blend
cs: prolínání

source: drawn mask
cs: načrtnutá maska

source: show and edit mask elements
cs: ukázat a editovat elementy masky

source: toggle polarity of drawn mask
cs: přepnout polaritu načrtnuté masky

source: add gradient
cs: přidat gradient

source: add path
cs: přidat cestu

source: add ellipse
cs: přidat elipsu

source: add circle
cs: přidat kruh

source: add brush
cs: přidat štětec

source: raster mask
cs: rastrová maska

source: toggle polarity of raster mask
cs: přepnout polaritu rastrové masky

source: normal
cs: normální

source: normal bounded
cs: normální svázaný

source: lighten
cs: zesvětlit

source: darken
cs: ztmavit

source: multiply
cs: násobit

source: average
cs: průměr

source: addition
cs: přidat

source: subtract
cs: odečíst

source: difference
cs: rozdíl
